; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	infrared4 - mode
	spectrograph6 - mode
	thermograph3 - mode
	image2 - mode
	spectrograph5 - mode
	infrared1 - mode
	infrared0 - mode
	image7 - mode
	GroundStation2 - direction
	Star5 - direction
	GroundStation0 - direction
	Star3 - direction
	Star4 - direction
	GroundStation6 - direction
	GroundStation1 - direction
	GroundStation7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 infrared4)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 image7)
	(supports instrument1 infrared0)
	(supports instrument1 image2)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 image7)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet10)
	(supports instrument3 thermograph3)
	(supports instrument3 infrared1)
	(supports instrument3 infrared4)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 Star4)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation6)
	(supports instrument4 spectrograph6)
	(supports instrument4 image7)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 Star4)
	(supports instrument5 image2)
	(supports instrument5 spectrograph6)
	(supports instrument5 spectrograph5)
	(calibration_target instrument5 GroundStation1)
	(calibration_target instrument5 GroundStation6)
	(supports instrument6 spectrograph6)
	(calibration_target instrument6 GroundStation7)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
)
(:goal (and
	(pointing satellite0 Star4)
	(pointing satellite1 GroundStation6)
	(have_image Phenomenon8 thermograph3)
	(have_image Planet9 infrared4)
	(have_image Planet9 infrared1)
	(have_image Planet10 spectrograph6)
	(have_image Phenomenon11 image2)
	(have_image Star12 image2)
))

)

; plan
1. (turn_to satellite2 groundstation1 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 groundstation1)
   goals met: 1 of 8
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 1 of 8
3. (calibrate satellite2 instrument5 groundstation1)
   added: (calibrated instrument5)
   goals met: 1 of 8
4. (turn_to satellite2 planet10 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 planet10)
   goals met: 1 of 8
5. (take_image satellite2 planet10 instrument5 spectrograph6)
   added: (have_image planet10 spectrograph6)
   goals met: 2 of 8
6. (turn_to satellite2 phenomenon11 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon11)
   goals met: 2 of 8
7. (turn_to satellite1 star3 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 star3)
   goals met: 1 of 8
8. (take_image satellite2 phenomenon11 instrument5 image2)
   added: (have_image phenomenon11 image2)
   goals met: 2 of 8
9. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 8
10. (calibrate satellite1 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 2 of 8
11. (turn_to satellite0 star4 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star4)
   goals met: 3 of 8
12. (turn_to satellite1 phenomenon8 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon8)
   goals met: 3 of 8
13. (take_image satellite1 phenomenon8 instrument3 thermograph3)
   added: (have_image phenomenon8 thermograph3)
   goals met: 4 of 8
14. (turn_to satellite1 planet9 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet9)
   goals met: 4 of 8
15. (take_image satellite1 planet9 instrument3 infrared1)
   added: (have_image planet9 infrared1)
   goals met: 5 of 8
16. (take_image satellite1 planet9 instrument3 infrared4)
   added: (have_image planet9 infrared4)
   goals met: 6 of 8
17. (turn_to satellite1 groundstation6 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 groundstation6)
   goals met: 7 of 8
18. (turn_to satellite2 star12 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 star12)
   goals met: 7 of 8
19. (take_image satellite2 star12 instrument5 image2)
   added: (have_image star12 image2)
   goals met: 8 of 8
